// Auto-generated source file
#include "global.h"
#include "gba/gba.h"
#include "battle/irc.h"

extern IrqTable gIntrHandlers;
extern const IrqTable gUnknown_080C7668;
extern const IrqTable gUnknown_080C7628;
extern const IrqTable gUnknown_080C7DB0;
extern const IrqTable gUnknown_080C5FA0;
extern u16 gUnknown_03004B00;

extern "C" void sub_0803E3D8();
extern "C" void sub_0805AFCC();
extern "C" void sub_080018F4();

extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0803D59C.inc", void sub_0803D59C());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0803D5EC.inc", void sub_0803D5EC());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0803D61C.inc", void sub_0803D61C());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0803D678.inc", void sub_0803D678());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0803D6C8.inc", void sub_0803D6C8());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0803D718.inc", void sub_0803D718());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0803D7CC.inc", void sub_0803D7CC());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0803D878.inc", void sub_0803D878());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0803D9A8.inc", void sub_0803D9A8());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0803DAAC.inc", void sub_0803DAAC());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0803DBB8.inc", void sub_0803DBB8());

extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_08059E18.inc", void sub_08059E18());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_08059E44.inc", void sub_08059E44());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_08059F6C.inc", void sub_08059F6C());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_08059FD8.inc", void sub_08059FD8());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A0A0.inc", void sub_0805A0A0());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A1A0.inc", void sub_0805A1A0());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A200.inc", void sub_0805A200());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A2A0.inc", void sub_0805A2A0());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A2C8.inc", void sub_0805A2C8());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A2DC.inc", void sub_0805A2DC());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A2F4.inc", void sub_0805A2F4());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A310.inc", void sub_0805A310());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A378.inc", void sub_0805A378());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A408.inc", void sub_0805A408());

extern "C" void sub_0805A418(void) {
    REG_IME = 0;
    REG_IE &= ~(INTR_FLAG_VBLANK | INTR_FLAG_HBLANK);
    REG_DISPSTAT &= ~(DISPSTAT_VBLANK_INTR | DISPSTAT_HBLANK_INTR);
    memcpy(&gIntrHandlers, &gUnknown_080C7DB0, sizeof(gUnknown_080C7DB0));
    REG_IME = 1;
}

extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A464.inc", void sub_0805A464());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/nullsub_93.inc", void nullsub_93());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A488.inc", void sub_0805A488());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A4BC.inc", void sub_0805A4BC());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A508.inc", void sub_0805A508());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A520.inc", void sub_0805A520());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A568.inc", void sub_0805A568());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A638.inc", void sub_0805A638());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A778.inc", void sub_0805A778());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A800.inc", void sub_0805A800());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A844.inc", void sub_0805A844());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A904.inc", void sub_0805A904());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805A9BC.inc", void sub_0805A9BC());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805AA90.inc", void sub_0805AA90());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805AB48.inc", void sub_0805AB48());
extern "C" ASM_FUNC("asm/non_matching/code_0803D59C/sub_0805AC30.inc", void sub_0805AC30());


typedef struct Struct_02015E00 {
    u8 _0; /* 0x00 */
    u8 _1; /* 0x01 */
    s16 _2; /* 0x02 */
    s16 _4; /* 0x04 */
    u8 _6[0x8-0x6]; /* 0x06 */
    u32 _8; /* 0x08 */
    u8 _c_0 : 1; /* 0x0c */
    u8 _c_1 : 1;
} Struct_02015E00;

extern Struct_02015E00 gUnknown_02015E00;


typedef struct Unknown_02016078 {
    u8 _pad_0[0x2700]; /* 0x0000 */
    u8 _2700[0x400]; /* 0x2700 first palette? */
    u8 pad_2B00[0x2C00-0x2B00]; /* 0x2B00 */
    u8 _pad_2C00[0x2C50-0x2C00]; /* 0x2C00 */
    u8 _2C50[0x10]; /* 0x2C50 */
    u8 _2C60[0x400]; /* 0x2C60 second palette? */
} Unknown_02016078;

typedef struct Unk_02016028 {
    vu16 bldcnt; /* 0x00 */
    vu16 bldalpha; /* 0x02 */
    vu16 bldy; /* 0x04 */
    u8 pad_6[0x8-0x6]; /* 0x06 */
    vu16 dispcnt; /* 0x08 */
    vu16 bg0cnt; /* 0x0A */
    vu16 bg1cnt; /* 0x0C */
    vu16 bg2cnt; /* 0x0E */
    vu16 bg3cnt; /* 0x10 */
    u8 pad_12[0x12-0x12]; /* 0x12 */
} Unk_02016028;


typedef struct SomeBlend {
    Unk_02016028 _0; /* 0x00 */
    u8 pad_14[0x50-0x14]; /* 0x14 */
    Unknown_02016078 _50; /* 0x50 */
} SomeBlend;

extern SomeBlend gSomeBlend;
extern const u8 gGBPlayerLogoPalette[0x200];
extern const u8 gGBPlayerLogoGfx[0x4000];
extern const u8 gGBPlayerLogoLayout[0x500];
extern u8 gUnknown_020050B0;
extern s8 gUnknown_020051E0;


extern "C" void sub_0805AEEC();
extern "C" void setup_vectors();
extern "C" void sub_0805ADBC();
extern "C" void sub_0805AD24();
extern "C" void sub_0805AD48();
extern "C" void sub_0805AF34(); 
extern "C" void sub_0805AD54();
extern "C" void sub_08001960();
extern "C" void sub_0805AE64();
extern "C" void sub_08001778(void* arg1, u16 arg2, u16 arg3, u16 arg4);
extern "C" void sub_08001A14(void* src, void* dest, u32 size);
extern "C" void sub_0800160C(Unknown_02016078* dest, void* src, int index, u32 size);
extern "C" void sub_08001A38(void* dest, u32 size, int value);
extern "C" void sub_080013D0(void* );
extern "C" void sub_08001454(void* );
extern "C" void sub_08001630(void* , int);
